In [1]:
import pandas as pd
import numpy as np

a=np.arange(100,110)
ds=pd.Series(a,name='roll_no',index=range(1,10+1))

print(ds)

1     100
2     101
3     102
4     103
5     104
6     105
7     106
8     107
9     108
10    109
Name: roll_no, dtype: int64

In [2]:
c=['tam','eng','mat','sci']
import pandas as pd

s=pd.DataFrame(np.random.randint(30,100,size=(10,4)),columns=c)
print(s)

   tam  eng  mat  sci
0   98   99   94   99
1   92   91   76   69
2   33   99   99   59
3   36   97   94   91
4   51   80   60   40
5   88   47   38   47
6   30   73   71   44
7   74   74   85   34
8   94   57   80   50
9   88   75   65   39

In [3]:
s.index=ds
#s[ds.name]=ds.values
#s.index=s[ds.name]
s

         tam  eng  mat  sci
roll_no
100       98   99   94   99
101       92   91   76   69
102       33   99   99   59
103       36   97   94   91
104       51   80   60   40
105       88   47   38   47
106       30   73   71   44
107       74   74   85   34
108       94   57   80   50
109       88   75   65   39

In [4]:
d=np.random.randint(30,100,size=4)
dd=zip(c,d)
dd=dict(dd)
#s=s.append(d,ignore_index=True)

In [5]:
s.loc[s['tam']>50,('tam','eng')]

         tam  eng
roll_no
100       98   99
101       92   91
104       51   80
105       88   47
107       74   74
108       94   57
109       88   75

In [7]:
s.describe()

             tam        eng        mat        sci
count  10.000000  10.000000  10.000000  10.000000
mean   68.400000  79.200000  76.200000  57.200000
std    27.825648  17.806366  18.617793  22.429148
min    30.000000  47.000000  38.000000  34.000000
25%    39.750000  73.250000  66.500000  41.000000
50%    81.000000  77.500000  78.000000  48.500000
75%    91.000000  95.500000  91.750000  66.500000
max    98.000000  99.000000  99.000000  99.000000